build/docs/renderer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-11 Sun 22:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building Interactive Experiment involving Binary Search Trees - Renderer Code</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ankit Pant, Danish Mukhtar, Giridhari Lal Gupta (APS Team) VLEAD" />
<link rel="stylesheet" type="text/css" href="./style/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="./style/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Building Interactive Experiment involving Binary Search Trees - Renderer Code</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgda15717">1. Introduction</a></li>
<li><a href="#orgc597b1b">2. Renderer</a></li>
<li><a href="#org372c378">3. Tangle</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgda15717" class="outline-2">
<h2 id="orgda15717"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The renderer is responsible for providing the visual representation of the various functions/operations provided by the Binary Search Tree Library. The renderer is used to set the various attributes like the radius of Binary Search Tree nodes, node color, animation delay, etc. The renderer uses the State Data (State information of trees) provided by the Tree Library API and uses that information to render a Binary Tree and also the various messages that are displayed in the Status bar. The Renderer uses D3.js library to facilitate it with displaying the Binary Search Tree visually.
</p>
</div>
</div>


<div id="outline-container-orgc597b1b" class="outline-2">
<h2 id="orgc597b1b"><span class="section-number-2">2</span> Renderer</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-js" id="org54247b7">
  <span style="font-weight: bold;">class</span> DAG {
      constructor(treeDivId,width,height,statusid){
          <span style="font-weight: bold; text-decoration: underline;">this</span>.canvas =d3.select(treeDivId).append(<span style="font-style: italic;">"svg"</span>)
              .attr(<span style="font-style: italic;">"width"</span>,width)
              .attr(<span style="font-style: italic;">"height"</span>,height);
          <span style="font-weight: bold; text-decoration: underline;">this</span>.animDuration=200;
          <span style="font-weight: bold; text-decoration: underline;">this</span>.tree = d3.layout.tree().size([400,400]);
          <span style="font-weight: bold; text-decoration: underline;">this</span>.realdata=<span style="font-weight: bold; text-decoration: underline;">null</span>;
          <span style="font-weight: bold; text-decoration: underline;">this</span>.node_color = <span style="font-style: italic;">"#009973"</span>;
          <span style="font-weight: bold; text-decoration: underline;">this</span>.highlight_color =<span style="font-style: italic;">"red"</span>;
          <span style="font-weight: bold; text-decoration: underline;">this</span>.circle_radius=<span style="font-style: italic;">"30px"</span>;
          <span style="font-weight: bold; text-decoration: underline;">this</span>.edge_color = <span style="font-style: italic;">"#0d26e5"</span>;
          <span style="font-weight: bold; text-decoration: underline;">this</span>.animDelay=5
          <span style="font-weight: bold; text-decoration: underline;">this</span>.stateChangeDuration = 1000
          <span style="font-weight: bold; text-decoration: underline;">this</span>.statusid = statusid
          <span style="font-weight: bold; text-decoration: underline;">this</span>.animationComplete = <span style="font-weight: bold; text-decoration: underline;">true</span>
      }
      GetAnimationDuration(){
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>.animDuration
      }
      GetNodeColor(){
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>.node_color
      }
      GetHighLightColor(){
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>.highlight_color
      }
      GetEdgeColor(){
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>.edge_color
      }
      GetCircleRadius(){
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>.circle_radius
      }
      GetAnimationDelay(){
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>.animDelay
      }

      GetStateChangeDuration(){
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>.stateChangeDuration
      }


      SetStateChangeDuration(ms){
          <span style="font-weight: bold; text-decoration: underline;">this</span>.stateChangeDuration = ms
      }
      SetAnimationDuration(ms){
          <span style="font-weight: bold; text-decoration: underline;">this</span>.animDuration = ms
      }
      SetNodeColor(color){
          <span style="font-weight: bold; text-decoration: underline;">this</span>.node_color = color
      }
      SetHighLightColor(color){
          <span style="font-weight: bold; text-decoration: underline;">this</span>.highlight_color = color
      }
      SetEdgeColor(color){
          <span style="font-weight: bold; text-decoration: underline;">this</span>.edge_color = color
      }
      SetCircleRadius(rad){
          <span style="font-weight: bold; text-decoration: underline;">this</span>.circle_radius = rad
      }
      SetAnimationDelay(animdeley){
          <span style="font-weight: bold; text-decoration: underline;">this</span>.animDelay = animdeley
      }


      sleep(timer){
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Promise</span>(resolve =&gt; setTimeout(resolve,timer));
      }
      async Render(animationstate){

          <span style="font-weight: bold;">for</span>(<span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0 ; i  &lt; animationstate.length ; i++){
              <span style="font-weight: bold;">if</span>(i==0){
                  <span style="font-weight: bold; text-decoration: underline;">this</span>.animationComplete=<span style="font-weight: bold; text-decoration: underline;">false</span>
              }
              <span style="font-weight: bold;">let</span>   <span style="font-weight: bold; font-style: italic;">data</span> = animationstate[i][0]
              <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">label</span> = animationstate[i][1]
              <span style="font-weight: bold;">let</span>  <span style="font-weight: bold; font-style: italic;">popupDialogue</span> = animationstate[i][2]
              <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">nodehighlighter</span> = animationstate[i][3]
              <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">console.log(popupDialogue)</span>
              <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">statusbar</span> = document.getElementById(<span style="font-weight: bold; text-decoration: underline;">this</span>.statusid);
              <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">status_data</span> = document.getElementById(<span style="font-weight: bold; text-decoration: underline;">this</span>.statusid).innerHTML;
              <span style="font-weight: bold;">if</span>(i==0){
                  status_data+=<span style="font-style: italic;">"&lt;br&gt;"</span>
              }
              <span style="font-weight: bold;">if</span>(popupDialogue!=<span style="font-style: italic;">""</span>){
                  status_data += popupDialogue ;
                  statusbar.innerHTML = status_data;
              }
              statusbar.scrollTop = statusbar.scrollHeight;

              <span style="font-weight: bold;">if</span>(i==animationstate.length-1){
                  <span style="font-weight: bold; text-decoration: underline;">this</span>.animationComplete=<span style="font-weight: bold; text-decoration: underline;">true</span>
                  <span style="font-weight: bold; font-style: italic;">//  </span><span style="font-weight: bold; font-style: italic;">console.log(this.animationCompletes)</span>
              }
              <span style="font-weight: bold;">try</span> {
                  <span style="font-weight: bold; text-decoration: underline;">this</span>.RenderingProcessFactory(data,label,<span style="font-weight: bold; text-decoration: underline;">this</span>.animDelay,nodehighlighter)
                  await <span style="font-weight: bold; text-decoration: underline;">this</span>.sleep(<span style="font-weight: bold; text-decoration: underline;">this</span>.stateChangeDuration);

              }
              <span style="font-weight: bold;">catch</span>(err) {

              }

          }


      }

      RenderingProcessFactory(data,key_to_highlight,animx,nodehighlighter){
          <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">console.log(data)</span>
          d3.selectAll(<span style="font-style: italic;">".node"</span>).remove();
          d3.selectAll(<span style="font-style: italic;">".link"</span>).remove();

          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">nodes</span> = <span style="font-weight: bold; text-decoration: underline;">this</span>.tree.nodes(data);

          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">links</span> = <span style="font-weight: bold; text-decoration: underline;">this</span>.tree.links(nodes);
          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">linker</span> = <span style="font-weight: bold; text-decoration: underline;">this</span>.canvas.append(<span style="font-style: italic;">"g"</span>).attr(<span style="font-style: italic;">"transform"</span>,<span style="font-style: italic;">"translate(50,50)"</span>);
          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">noder</span>  = <span style="font-weight: bold; text-decoration: underline;">this</span>.canvas.append(<span style="font-style: italic;">"g"</span>).attr(<span style="font-style: italic;">"transform"</span>,<span style="font-style: italic;">"translate(50,50)"</span>);
          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">diagonal</span> = d3.svg.diagonal();

          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">node</span> = noder.selectAll(<span style="font-style: italic;">".node"</span>)
              .data(nodes)
              .enter()
              .append(<span style="font-style: italic;">"g"</span>)
              .attr(<span style="font-style: italic;">"class"</span>,<span style="font-style: italic;">"node"</span>)
              .attr(<span style="font-style: italic;">"transform"</span>,<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">d</span>){
                  <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"translate("</span>+d.x + <span style="font-style: italic;">","</span> + d.y +<span style="font-style: italic;">")"</span>;
              });

          node.append(<span style="font-style: italic;">"circle"</span>)
              .attr(<span style="font-style: italic;">"r"</span>,<span style="font-weight: bold; text-decoration: underline;">this</span>.circle_radius)
              .attr(<span style="font-style: italic;">"id"</span>,<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">d</span>){<span style="font-weight: bold;">return</span> <span style="font-style: italic;">"node-"</span>+d.data})
              .attr(<span style="font-style: italic;">"fill"</span>,<span style="font-weight: bold; text-decoration: underline;">this</span>.node_color);

          node.append(<span style="font-style: italic;">"text"</span>)
              .attr(<span style="font-style: italic;">"dx"</span>,<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">d</span>){<span style="font-weight: bold;">return</span> -6})
              .attr(<span style="font-style: italic;">"dy"</span>,<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">d</span>){<span style="font-weight: bold;">return</span> 6})
              .text(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">d</span>){<span style="font-weight: bold;">return</span> d.data})
              .attr(<span style="font-style: italic;">"fill"</span>,<span style="font-style: italic;">"white"</span>);



          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">edges</span> = linker.selectAll(<span style="font-style: italic;">".link"</span>)
              .data(links)
              .enter()
              .append(<span style="font-style: italic;">"path"</span>) <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">lime</span>
              .attr(<span style="font-style: italic;">"class"</span>,<span style="font-style: italic;">"link"</span>)
              .attr(<span style="font-style: italic;">"fill"</span>,<span style="font-style: italic;">"none"</span>)
              .attr(<span style="font-style: italic;">"stroke"</span>,<span style="font-style: italic;">"#0d26e5"</span>)
              .attr(<span style="font-style: italic;">"d"</span>,diagonal);

          d3.select(<span style="font-style: italic;">"#node-"</span>+key_to_highlight)
              .transition().duration(<span style="font-weight: bold; text-decoration: underline;">this</span>.animDuration).delay(100)
              .style(<span style="font-style: italic;">"stroke"</span>,nodehighlighter)
              .style(<span style="font-style: italic;">"stroke-width"</span>,<span style="font-style: italic;">"6px"</span>);

          d3.select(<span style="font-style: italic;">"#node-"</span>+key_to_highlight)
              .transition().duration(<span style="font-weight: bold; text-decoration: underline;">this</span>.animDuration).delay(1000)
              .style(<span style="font-style: italic;">"stroke"</span>,<span style="font-weight: bold; text-decoration: underline;">this</span>.node_color)
              .style(<span style="font-style: italic;">"stroke-width"</span>,<span style="font-style: italic;">"6px"</span>);


      }

  }


</pre>
</div>
</div>
</div>

<div id="outline-container-org372c378" class="outline-2">
<h2 id="org372c378"><span class="section-number-2">3</span> Tangle</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-js">&lt;&lt;Renderer_Code&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ankit Pant, Danish Mukhtar, Giridhari Lal Gupta (APS Team) VLEAD</p>
<p class="date">Created: 2018-11-11 Sun 22:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
